read_verilog bitr_n.v 
hierarchy -check -top bitr_n
proc; fsm; opt; memory; opt; 
techmap
opt
dfflibmap -liberty ../lib/vsclib013.lib
abc -liberty ../lib/vsclib013.lib
write_json bitr_n_synth.json
write_verilog bitr_n_synth.v
json -o toto -aig


